{
  "Make": "Make is a categorical variable representing the vehicle manufacturer. It contains 42 distinct categories with no missing values. The distribution is moderately imbalanced: the most frequent brands are Ford, Chevrolet, and BMW, while a long tail of less frequent manufacturers accounts for about 46% of the observations. This suggests high categorical diversity, and grouping rare categories or applying appropriate encoding strategies may be necessary in downstream modeling.",
  "Model": "The variable Model is a high-cardinality text feature (2053 distinct values, 27.8%) with a highly skewed distribution. It combines heterogeneous information such as drivetrain, body type, and trim level, making it unsuitable for direct categorical encoding. Therefore, semantic feature extraction (e.g., drivetrain type, body style, performance indicators) is preferred over direct usage or one-hot encoding.",
  "Vehicle Class": "Vehicle Class is a low-cardinality categorical feature with 16 distinct categories and no missing values. The distribution is reasonably balanced across major vehicle segments (SUV, compact, mid-size, full-size).",
  "Engine Size(L)": "Engine Size (L) is a continuous variable ranging from 0.9 to 8.4 liters. The distribution is heavily concentrated at 2.0 L",
  "Cylindres": "Cylinders is treated as a categorical variable with eight discrete levels, dominated by 4-, 6-, and 8-cylinder engines.",
  "Transmission":"Transmission is a categorical variable with 27 distinct levels, combining transmission type and number of gears. Automatic transmissions with 6 to 8 gears dominate the dataset.",
  "Fuel Type": "Fuel Type is a categorical variable with five levels, dominated by regular (X) and premium (Z) gasoline, while alternative fuels (E85, diesel, natural gas) are relatively rare.",
  "Fuel Consumption Comb (L/100 km)": "The Fuel Consumption Comb (L/100 km) distribution is positively skewed (Skewness: 0.89), with a mean of 10.98 exceeding the median of 10.6. Most vehicles fall within the 8.9–12.6 range (IQR). The bimodal nature of the plot suggests the dataset contains two distinct vehicle classes with different efficiency profiles.",
   "Interactions": "CO2 emissions increase with engine size, showing a strong positive association. While the overall trend is approximately linear, the relationship exhibits a change in slope: emissions rise more steeply for smaller engines and tend to increase more gradually for larger engine sizes. \n The interaction between combined fuel consumption and CO2 emissions reveals a strong positive relationship. The scatter plot shows several nearly parallel linear patterns, indicating that while CO2 emissions increase approximately linearly with fuel consumption, the data consist of distinct subgroups with similar slopes but different intercepts. This suggests that fuel consumption is a primary driver of CO2 emissions, but additional categorical factors—such as fuel type or engine technology—likely influence emission levels."
}